# üõí E-Commerce Transaction Analysis Practice

This notebook contains **12 practice questions** focused on analyzing e-commerce transactions and backtracking transaction data.

## Instructions
1. First, run the database setup cell to create the database
2. Solve each question by writing SQL queries or Python code
3. Check your answers against the provided solutions

---

## üì¶ Setup: Create and Connect to Database

In [ ]:
# Run the database setup script first
%run ecommerce_db_setup.py

In [ ]:
# Import necessary libraries
import sqlite3
import pandas as pd

# Connect to the database
conn = sqlite3.connect('ecommerce.db')

# Helper function to run queries
def run_query(query):
    """Execute a SQL query and return results as a DataFrame"""
    return pd.read_sql_query(query, conn)

print("‚úì Connected to ecommerce.db successfully!")

‚úì Connected to ecommerce.db successfully!

## üìä Database Schema Overview

| Table | Description |
|-------|-------------|
| `customers` | Customer information (id, name, email, address, etc.) |
| `categories` | Product categories |
| `products` | Product catalog with prices and stock |
| `orders` | Order information with status (pending, shipped, completed, refunded, cancelled) |
| `order_items` | Individual items in each order |
| `payments` | Payment records for orders |
| `refunds` | Refund records for returned/refunded orders |

In [ ]:
# Preview Tables
print("=" * 60)
print("CUSTOMERS TABLE")
print("=" * 60)
display(run_query("SELECT * FROM customers LIMIT 5"))

print("\n" + "=" * 60)
print("PRODUCTS TABLE")
print("=" * 60)
display(run_query("SELECT * FROM products LIMIT 5"))

print("\n" + "=" * 60)
print("ORDERS TABLE")
print("=" * 60)
display(run_query("SELECT * FROM orders LIMIT 5"))

============================================================
CUSTOMERS TABLE
============================================================

,customer_id,first_name,last_name,email,phone,address,city,country,registration_date
0,1,John,Smith,john.smith@email.com,555-0101,123 Main St,New York,USA,2023-01-15
1,2,Emily,Johnson,emily.j@email.com,555-0102,456 Oak Ave,Los Angeles,USA,2023-02-20
2,3,Michael,Williams,mwilliams@email.com,555-0103,789 Pine Rd,Chicago,USA,2023-03-10
3,4,Sarah,Brown,sarah.b@email.com,555-0104,321 Elm St,Houston,USA,2023-04-05
4,5,David,Jones,djones@email.com,555-0105,654 Maple Dr,Phoenix,USA,2023-05-12

============================================================
PRODUCTS TABLE
============================================================

,product_id,product_name,category_id,price,stock_quantity,description
0,1,iPhone 15 Pro,1,999.99,50,Latest Apple smartphone
1,2,Samsung Galaxy S24,1,899.99,45,Premium Android phone
2,3,MacBook Air M3,1,1299.99,30,Apple laptop with M3 chip
3,4,AirPods Pro 2,1,249.99,100,Wireless earbuds
4,5,Nike Air Max,2,129.99,80,Running shoes

============================================================
ORDERS TABLE
============================================================

,order_id,customer_id,order_date,status,shipping_address,total_amount
0,1,1,2024-01-05 10:30:00,completed,"123 Main St, New York",1249.98
1,2,2,2024-01-07 14:15:00,completed,"456 Oak Ave, Los Angeles",899.99
2,3,3,2024-01-10 09:45:00,completed,"789 Pine Rd, Chicago",179.98
3,4,1,2024-01-12 16:20:00,completed,"123 Main St, New York",249.99
4,5,4,2024-01-15 11:00:00,shipped,"321 Elm St, Houston",1549.98

---

# üìù Practice Questions

---

## Question 1: Basic Transaction Lookup

**Find all orders placed by customer with ID 1, including the order date and total amount.**

Expected: List all orders for customer_id = 1

In [7]:
# YOUR CODE HERE
run_query("""SELECT * 

FROM orders

WHERE customer_id = 1
ORDER BY order_date DESC
""")

,order_id,customer_id,order_date,status,shipping_address,total_amount
0,18,1,2024-02-18 09:45:00,pending,"123 Main St, New York",149.99
1,4,1,2024-01-12 16:20:00,completed,"123 Main St, New York",249.99
2,1,1,2024-01-05 10:30:00,completed,"123 Main St, New York",1249.98

---

## Question 2: Transaction Details Backtracking

**For order ID 1, backtrack and find all the items purchased, including product names and quantities.**

This requires joining `order_items` with `products` table.

In [ ]:
# YOUR CODE HERE
run_query(
    """
    SELECT * 
    FROM orders o
    JOIN product p
        ON p.
    """
)

---

## Question 3: Identify Refunded Transactions

**Find all orders that have been refunded, including the customer name, order date, and refund details.**

Use JOIN to connect orders, customers, and refunds tables.

In [ ]:
# YOUR CODE HERE

In [ ]:
# SOLUTION
query = """
SELECT 
    o.order_id,
    c.first_name || ' ' || c.last_name AS customer_name,
    o.order_date,
    o.total_amount AS original_amount,
    r.refund_date,
    r.refund_amount,
    r.reason
FROM refunds r
JOIN orders o ON r.order_id = o.order_id
JOIN customers c ON o.customer_id = c.customer_id
ORDER BY r.refund_date;
"""
run_query(query)

---

## Question 4: Customer Transaction History

**Create a complete transaction history for customer "Emily Johnson" (customer_id = 2), showing all orders with their items.**

In [ ]:
# YOUR CODE HERE

---

## Question 5: Payment Method Analysis

**Analyze transactions by payment method. Show the total revenue and number of transactions for each payment method.**

In [ ]:
# YOUR CODE HERE

In [ ]:
# SOLUTION
query = """
SELECT 
    payment_method,
    COUNT(*) AS transaction_count,
    SUM(amount) AS total_revenue,
    ROUND(AVG(amount), 2) AS avg_transaction
FROM payments
WHERE status = 'completed'
GROUP BY payment_method
ORDER BY total_revenue DESC;
"""
run_query(query)

---

## Question 6: Cancelled Orders Analysis

**Find all cancelled orders and calculate the total revenue lost from cancellations. Include what products were in those orders.**

In [ ]:
# YOUR CODE HERE

---

## Question 7: Top Spending Customers

**Find the top 5 customers by total spending (completed orders only). Include their email and total orders count.**

In [ ]:
# YOUR CODE HERE

---

## Question 8: Product Sales Tracking

**Find the best-selling products by quantity sold. Include the category name and total revenue generated by each product.**

In [ ]:
# YOUR CODE HERE

---

## Question 9: Order Status Summary

**Create a summary showing the count and total value of orders for each status (pending, shipped, completed, refunded, cancelled).**

In [ ]:
# YOUR CODE HERE

---

## Question 10: Monthly Revenue Trend

**Analyze the monthly revenue trend. Group completed orders by month and show the revenue progression.**

In [ ]:
# YOUR CODE HERE

---

## Question 11: Full Transaction Backtrack

**For a complete audit, create a query that shows the full lifecycle of order ID 7 (a refunded order):**
- Customer info
- Order details
- Items purchased
- Payment info
- Refund info

In [ ]:
# YOUR CODE HERE

---

## Question 12: Category Performance Analysis

**Analyze the performance of each product category:**
- Total products sold
- Total revenue
- Number of orders
- Average order value per category
- Refund rate (percentage of refunded orders)

In [ ]:
# YOUR CODE HERE

---

# üéØ Bonus Challenge

Create your own query to:
1. Find customers who have never made a purchase
2. Identify products that have never been sold
3. Calculate the customer lifetime value (CLV)

In [ ]:
# Close the connection when done
conn.close()
print("Database connection closed.")

---

## üìö Summary

In this practice notebook, you learned how to:

1. **Basic Lookups** - Query orders by customer
2. **Transaction Backtracking** - Trace order items from orders
3. **Refund Analysis** - Track refunded transactions
4. **Customer History** - Complete transaction history
5. **Payment Analysis** - Group by payment methods
6. **Cancelled Orders** - Revenue loss analysis
7. **Top Customers** - Customer spending analysis
8. **Product Performance** - Sales tracking
9. **Order Status** - Status summary reports
10. **Trend Analysis** - Monthly revenue trends
11. **Full Audit Trail** - Complete transaction lifecycle
12. **Category Analysis** - Performance by category

These skills are essential for:
- E-commerce analytics
- Transaction auditing
- Customer behavior analysis
- Financial reporting